app/services/shortener.rb

INSERT INTO "links" ("lookup_code", "original_url", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["lookup_code", "7842204"], ["original_url", "hhhh"], ["created_at", "2021-04-23 19:38:14.527859"], ["updated_at", "2021-04-23 19:38:14.527859"]]
---
    def generata_short_link
        link_model.create(original_url: url, lookup_code: lookup_code)