app/controllers/links_controller.rb

SELECT "links".* FROM "links" WHERE "links"."lookup_code" = ? LIMIT ?  [["lookup_code", "f127194"], ["LIMIT", 1]]
---
    def show
        @link = Link.find_by(lookup_code: params[:lookup_code])